tests/load/artillery.yaml
config:
  target: "http://localhost:8080"   # Replace with your Service B URL
  phases:
    - duration: 120       # Run for 60 seconds
      arrivalRate: 100     # Start 5 requests per second
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Generic Microservice Load Test"
    flow:
      - post:
          url: "/request"
          json:
            protocol: "REST"
            operation: "getUsers"
            payload:  {}